using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.ComponentModel.DataAnnotations;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MusicPortal.DAL.Enum
{
    public enum GenreEnum
    {
        [Display(Name = "Абстрактный хипхоп")]
        Абстрактный_хипхоп,
        [Display(Name = "Авангардная музыка")]
        Авангардная_музыка,
        [Display(Name = "Авторская песня")]
        Авторская_песня,
        [Display(Name = "Академическая музыка")]
        Академическая_музыка,
        [Display(Name = "Альтернативный метал")]
        Альтернативный_метал,
        [Display(Name = "Альтернативный рок")]
        Альтернативный_рок,
        [Display(Name = "Альтернативный хипхоп")]
        Альтернативный_хипхоп,
        [Display(Name = "Андеграунд")]
        Андеграунд,
        [Display(Name = "Артрок")]
        Артрок,
        [Display(Name = "Балет")]
        Балет,
        [Display(Name = "Блюз")]
        Блюз,
        [Display(Name = "Брейкбит")]
        Брейкбит,
        [Display(Name = "Визиофония")]
        Визиофония,
        [Display(Name = "Восьмибитная музыка")]
        Восьмибитная_музыка,
        [Display(Name = "Гангстарэп")]
        Гангстарэп,
        [Display(Name = "Гаражный рок")]
        Гаражный_рок,
        [Display(Name = "Глэмрок")]
        Глэмрок,
        [Display(Name = "Гоатранс")]
        Гоатранс,
        [Display(Name = "Госпел")]
        Госпел,
        [Display(Name = "Грайм")]
        Грайм,
        [Display(Name = "Грайндкор")]
        Грайндкор,
        [Display(Name = "Гранж")]
        Гранж,
        [Display(Name = "Гэридж")]
        Гэридж,
        [Display(Name = "ДДаб")]
        ДДаб,
        [Display(Name = "Дабстеп")]
        Дабстеп,
        [Display(Name = "Даркэмбиент")]
        Даркэмбиент,
        [Display(Name = "Даунтемпо")]
        Даунтемпо,
        [Display(Name = "Джаз")]
        Джаз,
        [Display(Name = "Джангл")]
        Джангл,
        [Display(Name = "Диско")]
        Диско,
        [Display(Name = "Драмнбэйс")]
        Драмнбэйс,
        Дэнсхолл,
        Евродэнс,
        Индастриал,
        Индастриалрок,
        [Display(Name = "Инди")]
        Инди_музыка,
        Индипоп,
        Индирок,
        [Display(Name = "Инструментальный хипхоп")]
        Инструментальный_хипхоп,
        Кантри,
        [Display(Name = "Классическая музыка")]
        Классическая_музыка,
        Метал,
        Минималтехно,
       Нашиды,
        [Display(Name = "Нашиды Исламского государства")]
        Нашиды_Исламского_государства,
        Нейрофанк,
        [Display(Name = "Новая волна музыка")]
        Новая_волна_музыка,
        Нойз,
        Нюметал,
        Опера,
        Панк,
        Панкрок,
        Песни,
        Попмузыка,
        Постгранж,
        Постпанк,
        Построк,
        [Display(Name = "Прогрессивный рок")]
        Прогрессивный_рок,
        [Display(Name = "Психоделическая музыка")]
        Психоделическая_музыка,
        Раггаджангл,
        Регги,
        Рейв,
        Ритмнблюз,
        Рокмузыка,
        Рокнролл,
        [Display(Name = "Русский рок")]
        Русский_рок,
        [Display(Name = "Русский Шаносон")]
        Русский_шансон,
        Рэп,
        Рэпметал,
        Рэпрок,
        Рэпкор,
        Свинг,
        Симфоническая_музыка,
        Синтипоп,
        Тёрнтейблизм,
        Техно,
        [Display(Name = "Транс музыкальный жанр")]
        Транс_музыкальный_жанр,
        Трипхоп,
        Трэп,
        Фанк,
        Фолкмузыка,
        Фолкрок,
        Фриджаз,
        Хардрок,
        Хардкорпанк,
        Хардстайл,
        Хаус,
        [Display(Name = "Хипхоп музыкальный жанр")]
        Хипхоп_музыкальный_жанр,
        [Display(Name = "Хипхоп Восточного побережья")]
        Хипхоп_Восточного_побережья,
        [Display(Name = "Хипхоп Западного побережья")]
        Хипхоп_Западного_побережья,
        [Display(Name = "Художественная декламация")]
        Художественная_декламация,
        Частушки,
        Шансон,
        [Display(Name = "Экспериментальная музыка")]
        Экспериментальная_музыка,
        [Display(Name = "Электро музыкальный жанр")]
        Электро_музыкальный_жанр,
        Электроклэш,
        Электроникрок,
        [Display(Name = "Электронная музыка")]
        Электронная_музыка,
        Эмбиент,
        [Display(Name = "Эмо музыкальный стиль")]
        Эмо_музыкальный_стиль,
        Эмокор,
        Эстрада,
        Hyperpop,
        [Display(Name = "Intelligent Dance Music")]
        Intelligent_Dance_Music,
        Kpop,
        Psytrance,
    }
}
